app/controllers/api/v1/images_controller.rb

SELECT "images".* FROM "images" ORDER BY "images"."created_at" DESC
---
  def index
    image = Image.all.order(created_at: :desc)

INSERT INTO "images" ("uploader_name", "discription", "creator_name", "image", "category", "access_level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    image = Image.create!(image_params)

DELETE FROM "images" WHERE "images"."id" = $1  [["id", 7]]
---
  def destroy
    image&.destroy

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def image
    @image ||= Image.find(params[:id])